package com.javarush.test.level03.lesson12.home01;

/* Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
*/

//TODO: Чонить

public class Solution
{
    private String s;
    private String d;
    private String a;
    private String b;



    public Solution(String s, String d) {
        this.s = s;
        this.d = d;
    }

    public static void main(String[] args)
    {

//       for () {
            System.out.println("");
        }



    }
    

